; domain
(define (domain zeno-travel)
(:requirements :typing)
(:types aircraft person - locatable
	locatable city flevel - object)
(:predicates (at ?x - locatable ?c - city)
             (in ?p - person ?a - aircraft)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)
 
 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1)
		 (next ?l3 ?l2)
		)
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
	)
) 

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (next ?l ?l1)
                 (at ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))


)

; problem
(define (problem ZTRAVEL-4-5)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city6)
	(fuel-level plane1 fl0)
	(at plane2 city1)
	(fuel-level plane2 fl0)
	(at plane3 city6)
	(fuel-level plane3 fl0)
	(at plane4 city3)
	(fuel-level plane4 fl0)
	(at person1 city3)
	(at person2 city0)
	(at person3 city3)
	(at person4 city3)
	(at person5 city2)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city2)
	(at person3 city0)
	(at person4 city0)
	(at person5 city6)
	))

)

; plan
1. (refuel plane4 city3 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 0 of 4
2. (refuel plane4 city3 fl1 fl2)
   deleted: (fuel-level plane4 fl1)
   added: (fuel-level plane4 fl2)
   goals met: 0 of 4
3. (board person4 plane4 city3)
   deleted: (at person4 city3)
   added: (in person4 plane4)
   goals met: 0 of 4
4. (board person3 plane4 city3)
   deleted: (at person3 city3)
   added: (in person3 plane4)
   goals met: 0 of 4
5. (board person1 plane4 city3)
   deleted: (at person1 city3)
   added: (in person1 plane4)
   goals met: 0 of 4
6. (fly plane4 city3 city0 fl2 fl1)
   deleted: (at plane4 city3) (fuel-level plane4 fl2)
   added: (at plane4 city0) (fuel-level plane4 fl1)
   goals met: 0 of 4
7. (debark person4 plane4 city0)
   deleted: (in person4 plane4)
   added: (at person4 city0)
   goals met: 1 of 4
8. (debark person3 plane4 city0)
   deleted: (in person3 plane4)
   added: (at person3 city0)
   goals met: 2 of 4
9. (fly plane4 city0 city2 fl1 fl0)
   deleted: (at plane4 city0) (fuel-level plane4 fl1)
   added: (at plane4 city2) (fuel-level plane4 fl0)
   goals met: 2 of 4
10. (board person5 plane4 city2)
   deleted: (at person5 city2)
   added: (in person5 plane4)
   goals met: 2 of 4
11. (debark person1 plane4 city2)
   deleted: (in person1 plane4)
   added: (at person1 city2)
   goals met: 3 of 4
12. (refuel plane4 city2 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 3 of 4
13. (fly plane4 city2 city6 fl1 fl0)
   deleted: (at plane4 city2) (fuel-level plane4 fl1)
   added: (at plane4 city6) (fuel-level plane4 fl0)
   goals met: 3 of 4
14. (debark person5 plane4 city6)
   deleted: (in person5 plane4)
   added: (at person5 city6)
   goals met: 4 of 4
